php183/app/Http/Controllers/Admin/CategoryController.php

select *, concat(cid,',',id) AS sort_cid from `goods_cat_t` order by `sort_cid` asc
---
    public function index()
    {
        //
        $data = \DB::table('goods_cat_t')->select("*",\DB::raw("concat(cid,',',id) AS sort_cid"))->orderBy('sort_cid')->get();

delete from `goods_cat_t` where `id` = '14'
---
    public function delete($id)
    {
        //
       $res = \DB::table('goods_cat_t')->where('id',$id)->delete();