php183/app/Http/Controllers/Admin/GoodsController.php

select * from `goods_t`
---
    public function index()
    {
        //
        // dd(123);
        $data = \DB::table('goods_t')->get();