php183/app/Http/Controllers/Admin/LoginController.php

	public function dologin(Request $request)
	{
		$data = $request->except("_token");

		// 验证是否记住我
		$remember_token = \Cookie::get('remember_token');
		if($remember_token)
		{	$admin = \DB::table('user_t')->where('remember_token',$remember_token)->first();

		// 存入session
		session(['master' => $admin]);
			return redirect('/admin/index') -> with(['info' => '登陆成功']);
		}

		// 验证码是否正确
		$code = session('code');
		if($code !== $data['code'])
		{
			return back()->with(['info' => '验证码错误']);
		}

		// 查询用户
		$user = \DB::table('user_t')->where('name',$data['name'])->first();
---
select * from `user_t` where `name` = 'bbbbbb' limit 1